Tekla Open API Reference for Tekla Structures 2025
RebarSet.Delete Method
 Deletes the rebar set instance with the given identifier from the model database.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Delete()
Public Overrides Function Delete As Boolean
Return Value
Type: Boolean
True if successful, otherwise false.
See Also
Reference
RebarSet Class
Tekla.Structures.Model Namespace